In [1]:
#Importing Libraries
import pandas as pd
import numpy as np
import os
import seaborn as sns
import scipy
import matplotlib.pyplot as plt

In [2]:
path = r'C:\Users\javed\instacart Basket Analysis'

In [3]:
df = pd.read_pickle(os.path.join(path, '02 Data', 'Prepared Data', 'merged_data.pkl'))

In [5]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 1000000 entries, 0 to 999999
Data columns (total 30 columns):
 #   Column                 Non-Null Count    Dtype
---  ------                 --------------    -----
 0   user_id                1000000 non-null  int64
 1   First Name             945182 non-null   object
 2   Surnam                 1000000 non-null  object
 3   Gender                 1000000 non-null  object
 4   STATE                  1000000 non-null  object
 5   Age                    1000000 non-null  int64
 6   date_joined            1000000 non-null  object
 7   n_dependants           1000000 non-null  int64
 8   fam_status             1000000 non-null  object
 9   income                 1000000 non-null  int64
 10  order_id               1000000 non-null  int64
 11  eval_set               1000000 non-null  object
 12  order_number           1000000 non-null  int64
 13  orders_day_of_week     1000000 non-null  int64
 14  order_hour_of_day      1000000 non-null  int64
 15  product_id             1000000 non-null  int64
 16  add_to_cart_order      1000000 non-null  int64
 17  reordered              1000000 non-null  int64
 18  _merge                 1000000 non-null  category
 19  product_name           1000000 non-null  object
 20  aisle_id               1000000 non-null  int64
 21  department_id          1000000 non-null  int64
 22  prices                 1000000 non-null  float64
 23  price_range            1000000 non-null  object
 24  busiest_days           1000000 non-null  object
 25  busiest_period_of_day  1000000 non-null  object
 26  max_order              1000000 non-null  int64
 27  loyalty_flag           1000000 non-null  object
 28  avg_price              1000000 non-null  float64
 29  spending_flag          1000000 non-null  object
dtypes: category(1), float64(2), int64(14), object(13)
memory usage: 229.8+ MB

In [9]:
dff = df.drop(columns = ['eval_set', 'add_to_cart_order', '_merge', 'aisle_id', 'reordered'])

In [10]:
dff.head()

,user_id,First Name,Surnam,Gender,STATE,Age,date_joined,n_dependants,fam_status,income,...,product_name,department_id,prices,price_range,busiest_days,busiest_period_of_day,max_order,loyalty_flag,avg_price,spending_flag
0,26711,Deborah,Esquivel,Female,Missouri,48,1/1/2017,3,married,165665,...,Soda,7,9.0,Mid Range Product,Busiest Days,Most Orders,8,New Customer,11.4,High Spender
1,26711,Deborah,Esquivel,Female,Missouri,48,1/1/2017,3,married,165665,...,Soda,7,9.0,Mid Range Product,Regularly Busy,Average Orders,8,New Customer,11.4,High Spender
2,26711,Deborah,Esquivel,Female,Missouri,48,1/1/2017,3,married,165665,...,Soda,7,9.0,Mid Range Product,Busiest Days,Average Orders,8,New Customer,11.4,High Spender
3,26711,Deborah,Esquivel,Female,Missouri,48,1/1/2017,3,married,165665,...,0% Greek Strained Yogurt,16,12.6,Mid Range Product,Regularly Busy,Most Orders,8,New Customer,11.4,High Spender
4,26711,Deborah,Esquivel,Female,Missouri,48,1/1/2017,3,married,165665,...,0% Greek Strained Yogurt,16,12.6,Mid Range Product,Least Busy Days,Most Orders,8,New Customer,11.4,High Spender

In [11]:
dff.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 1000000 entries, 0 to 999999
Data columns (total 25 columns):
 #   Column                 Non-Null Count    Dtype
---  ------                 --------------    -----
 0   user_id                1000000 non-null  int64
 1   First Name             945182 non-null   object
 2   Surnam                 1000000 non-null  object
 3   Gender                 1000000 non-null  object
 4   STATE                  1000000 non-null  object
 5   Age                    1000000 non-null  int64
 6   date_joined            1000000 non-null  object
 7   n_dependants           1000000 non-null  int64
 8   fam_status             1000000 non-null  object
 9   income                 1000000 non-null  int64
 10  order_id               1000000 non-null  int64
 11  order_number           1000000 non-null  int64
 12  orders_day_of_week     1000000 non-null  int64
 13  order_hour_of_day      1000000 non-null  int64
 14  product_id             1000000 non-null  int64
 15  product_name           1000000 non-null  object
 16  department_id          1000000 non-null  int64
 17  prices                 1000000 non-null  float64
 18  price_range            1000000 non-null  object
 19  busiest_days           1000000 non-null  object
 20  busiest_period_of_day  1000000 non-null  object
 21  max_order              1000000 non-null  int64
 22  loyalty_flag           1000000 non-null  object
 23  avg_price              1000000 non-null  float64
 24  spending_flag          1000000 non-null  object
dtypes: float64(2), int64(11), object(12)
memory usage: 198.4+ MB

In [12]:
dff['spending_flag'].value_counts(dropna = False)

Low Spender     760344
High Spender    239656
Name: spending_flag, dtype: int64

In [13]:
dff['loyalty_flag'].value_counts(dropna = False)

Regular Customer    463844
Loyal Customer      335086
New Customer        201070
Name: loyalty_flag, dtype: int64

In [14]:
dff['fam_status'].value_counts(dropna = False)

married                             702411
single                              164028
divorced/widowed                     85685
living with parents and siblings     47876
Name: fam_status, dtype: int64

In [15]:
dff['n_dependants'].value_counts(dropna = False)

2    251552
3    251305
0    249713
1    247430
Name: n_dependants, dtype: int64

In [16]:
dff['product_name'].value_counts(dropna = False)

Bag of Organic Bananas                      379450
Organic Avocado                             176815
Organic Half & Half                          76360
Organic Unsweetened Almond Milk              57895
Original Hummus                              57198
Uncured Genoa Salami                         41473
Soda                                         35791
Bartlett Pears                               35413
Creamy Almond Butter                         21490
Organic Unsweetened Vanilla Almond Milk      15935
Honeycrisp Apples                            13880
0% Greek Strained Yogurt                     13238
Cheddar Bunnies Snack Crackers               10557
Roasted Turkey                               10195
Zero Calorie Cola                             8558
Plantain Chips                                7192
Original Beef Jerky                           6476
Organic String Cheese                         6196
Organic Fuji Apples                           5526
Milk Chocolate Almonds                        5019
Cinnamon Toast Crunch                         3751
Thin Stackers Brown Rice Lightly Salted       3012
Aged White Cheddar Popcorn                    2523
Pistachios                                    1946
Chipotle Beef & Pork Realstick                1370
XL Pick-A-Size Paper Towel Rolls              1214
Baked Organic Sea Salt Crunchy Pea Snack      1166
Organic Just Concord Grape Juice               361
Name: product_name, dtype: int64

In [17]:
dff['Gender'].value_counts(dropna = False)

Male      502845
Female    497155
Name: Gender, dtype: int64

In [24]:
dff.groupby('loyalty_flag').agg({'prices' : ['mean', 'max']})

                    prices
                      mean   max
loyalty_flag
Loyal Customer    7.897711  14.8
New Customer      7.738627  14.8
Regular Customer  7.798050  14.8

In [26]:
dff['Gender'].value_counts(dropna = False)

Male      502845
Female    497155
Name: Gender, dtype: int64

In [31]:
dff.groupby('fam_status').agg({'max_order' : ['mean']})

                                  max_order
                                       mean
fam_status
divorced/widowed                  34.434347
living with parents and siblings  34.428733
married                           33.619540
single                            33.620376

In [32]:
dff['price_range'].value_counts(dropna = False)

Mid Range Product    756450
Low Range Product    243550
Name: price_range, dtype: int64

In [33]:
dff.to_pickle(os.path.join(path, '02 Data', 'Prepared Data', 'final.pkl'))